lithiumhead/Black_Cloud_STC15L2K32S2/03_dht11/main.c
// Program Description: Read DHT11 and send to UART
// Author: Anurag Chugh

#include "../STC15F2K60S2.H"

typedef unsigned char BYTE;

#define OSCILLATOR_FREQ_HZ 11059200UL
#define BAUD_BPS 115200UL

#define BAUD_RELOAD (65536UL - (OSCILLATOR_FREQ_HZ / 4UL / BAUD_BPS))
#define BAUD_RELOAD_L ((BAUD_RELOAD) & 0xff)
#define BAUD_RELOAD_H ((BAUD_RELOAD>>8) & 0xff)

#define NONE_PARITY 0
#define ODD_PARITY 1
#define EVEN_PARITY 2
#define MARK_PARITY 3
#define SPACE_PARITY 4

#define PARITYBIT NONE_PARITY

#define S1_S0 0x40 // P_SW1.6
#define S1_S1 0x80 // P_SW1.7

char busy;

// DHT11 Bytes
unsigned char TP_H = 0;
unsigned char TP_L = 0;
unsigned char RH_H = 0;
unsigned char RH_L = 0;
unsigned char CR_D = 0;
#define DHT11_PIN P3_5

void SendData(BYTE dat);
void SendString(char *s);

void delay_5us(unsigned char us);
void delay_ms(unsigned long cnt);

__bit DHT11_ReadBit(void);
void DHT11_Read(void);

void main() {
  P0M0 = 0x00;
  P0M1 = 0x00;
  P1M0 = 0x00;
  P1M1 = 0x00;
  P2M0 = 0x00;
  P2M1 = 0x00;
  P3M0 = 0x00; // P3M1.n,P3M0.n   =00--->Standard,    01--->push-pull
  P3M1 = 0x00; //                 =10--->pure input,  11--->open drain
  P4M0 = 0x00;
  P4M1 = 0x00;
  P5M0 = 0x00;
  P5M1 = 0x00;
  P6M0 = 0x00;
  P6M1 = 0x00;
  P7M0 = 0x00;
  P7M1 = 0x00;

  ACC = P_SW1;
  ACC &= ~(S1_S0 | S1_S1); // S1_S0=0 S1_S1=0
  P_SW1 = ACC;             // Use P3.0/RxD, P3.1/TxD

#if (PARITYBIT == NONE_PARITY)
  SCON = 0x50; // 8-bit variable baud rate
#elif (PARITYBIT == ODD_PARITY) || (PARITYBIT == EVEN_PARITY) ||               \
    (PARITYBIT == MARK_PARITY)
  SCON = 0xda; // 9-bit variable baud rate, parity bit is initially 1
#elif (PARITYBIT == SPACE_PARITY)
  SCON = 0xd2; // 9-bit variable baud rate, parity bit is initially 0
#endif

  T2L = BAUD_RELOAD_L; // Set baud rate reload value
  T2H = BAUD_RELOAD_H;
  AUXR = 0x14;  // T2 is in 1T mode, and start Timer 2.
  AUXR |= 0x01; // Select Timer 2 as the baud rate generator of serial port 1.
  ES = 1;       // Enable serial port 1 interrupt.
  EA = 1;

  SendString("STC15L2K32S2\r\nUART1 @ 115200 bps! | DHT11 @ P3.5\r\n");
  while (1) {
    DHT11_Read();
    SendString("Humidity: ");
    SendData(((RH_H%100)/10)+'0');
    SendData(((RH_H%10))+'0');
    SendData((RH_L)+'0');
    SendString(" % | Temperature: ");
    SendData(((TP_H%100)/10)+'0');
    SendData(((TP_H%10))+'0');
    SendData((TP_L)+'0');
    SendString(" Celsius\r\n");
    delay_ms(1000);
  };
}

// Send a character over UART
void SendData(BYTE dat) {
  while (busy)
    ;        // Waiting for the previous data to be sent
  ACC = dat; // Get check bit (PSW.0)
  if (P) {   // Set check bit according to Parity
#if (PARITYBIT == ODD_PARITY)
    TB8 = 0; // Set Check Bit to 0
#elif (PARITYBIT == EVEN_PARITY)
    TB8 = 1;   // Set Check Bit to 1
#endif
  } else {
#if (PARITYBIT == ODD_PARITY)
    TB8 = 1; // Set Check Bit to 1
#elif (PARITYBIT == EVEN_PARITY)
    TB8 = 0;   // Set Check Bit to 0
#endif
  }
  busy = 1;
  SBUF = ACC; // Write data to the UART data register
}

// Send a whole string over UART
void SendString(char *s) {
  while (*s) {      // Detect string end character '\0'
    SendData(*s++); // Send current character
  }
}

// Delay function
void delay_5us(unsigned char us) {
  unsigned char i = 0;
  for (; us; us--)
    for (i = 0; i < 14; i++)
      ;
}

// Delay function
void delay_ms(unsigned long cnt) {
  for (; cnt; cnt--)
    delay_5us(200);
}

// Read DHT11 Bit
__bit DHT11_ReadBit(void) {
  unsigned char t = 0;
  delay_5us(6);
  while (DHT11_PIN == 0)
    ;
  for (t = 0; DHT11_PIN; t++)
    delay_5us(1);
  if (t > 10)
    return 1;
  else
    return 0;
}

void DHT11_Read(void) {
  unsigned char i;
  DHT11_PIN = 0;
  delay_ms(20);
  DHT11_PIN = 1;
  delay_5us(10);
  while (DHT11_PIN == 0)
    ;
  delay_5us(6);
  while (DHT11_PIN)
    ;
  for (i = 0; i < 8; i++) {
    if (DHT11_ReadBit())
      TP_H = ((TP_H << 1) + 1);
    else
      TP_H <<= 1;
  }
  for (i = 0; i < 8; i++) {
    if (DHT11_ReadBit())
      TP_L = ((TP_L << 1) + 1);
    else
      TP_L <<= 1;
  }
  for (i = 0; i < 8; i++) {
    if (DHT11_ReadBit())
      RH_H = ((RH_H << 1) + 1);
    else
      RH_H <<= 1;
  }
  for (i = 0; i < 8; i++) {
    if (DHT11_ReadBit())
      RH_L = ((RH_L << 1) + 1);
    else
      RH_L <<= 1;
  }
  for (i = 0; i < 8; i++) {
    if (DHT11_ReadBit())
      CR_D = ((CR_D << 1) + 1);
    else
      CR_D <<= 1;
  }
}
